In [9]:
import pandas as pd
import csv as csv

In [10]:
school_data_path= r'/home/mo/Documents/UNC/pandas-challenge/PyCitySchools/Resources/schools_complete.csv'
student_data_path= r'/home/mo/Documents/UNC/pandas-challenge/PyCitySchools/Resources/students_complete.csv'

In [11]:
#transforming these 2 paths(the original csv paths) to panda data frames so we can start to manipilate and giving them a variable names:
school_data = pd.read_csv(school_data_path)
student_data = pd.read_csv(student_data_path)
display(school_data.head())
display(student_data.head())

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [12]:
#we will merge both datas together and assigning the new merged data frame to a new variable. 2 in 1
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name","school_name"])
school_data_complete.describe()

,Student ID,reading_score,math_score,School ID,size,budget
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,81.87784,78.985371,6.978172,3332.957110,2.117241e+06
std,11307.549359,10.23958,12.309968,4.444329,1323.914069,8.749987e+05
min,0.000000,63.00000,55.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,73.00000,69.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,82.00000,79.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,91.00000,89.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,99.00000,99.000000,14.000000,4976.000000,3.124928e+06

# District Summary

#### Renaming some of the columns to avoid errors

In [13]:
school_data_complete = school_data_complete.rename(columns={
    'Student ID': 'student_id',
    'School ID': 'school_id'
}

)
school_data_complete.head()

,student_id,student_name,gender,grade,school_name,reading_score,math_score,school_id,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

### Total number of unique schools

In [14]:
school_count = school_data_complete['school_name'].value_counts().count()
school_count

15

### Total students

In [15]:
student_count = len(school_data_complete['student_name'])
student_count

39170

### Total budget

In [16]:
total_budget = school_data_complete['budget'].unique()
total_budget = total_budget.sum()
#or using the school_data data frame
# total_budget = school_data['budget'].sum()
# display(total_budget)

### Average math score

In [17]:
average_math_score = school_data_complete['math_score'].mean()
average_math_score

78.98537145774827

### Average reading score

In [18]:
average_reading_score = school_data_complete['reading_score'].mean()
average_reading_score

81.87784018381414

### % passing math (the percentage of students who passed math)

In [19]:
passing_math_count = school_data_complete[(school_data_complete['math_score'] >= 70)].count()['student_name']
passing_math_percentage = passing_math_count / float(student_count) * 100
passing_math_percentage

74.9808526933878

### % passing reading (the percentage of students who passed reading)

In [20]:
passing_reading_count = school_data_complete[(school_data_complete['reading_score'] >= 70)].count()['student_name']
passing_reading_percentage = passing_reading_count / float(student_count) * 100
passing_reading_percentage

85.80546336482001

### % overall passing (the percentage of students who passed math AND reading)

In [21]:
passing_math_reading_count = school_data_complete[(school_data_complete['math_score'] >= 70 )&(school_data_complete['reading_score'] >= 70)].count()['student_name']
passing_math_reading_percentage = passing_math_reading_count / student_count * 100
passing_math_reading_percentage

65.17232575950983

# District Summary Data Frame

In [22]:
district_summary = pd.DataFrame({
    'Total Schools' : [school_count],
    'Total Students' : [student_count],
    'Total Budget' : [total_budget],
    'Average Math Score': [average_math_score],
    'Average Reading Score': [average_reading_score],
    '%Passing Math':[passing_math_percentage],
    '%Passing Reading':[passing_reading_percentage],
    '%Overall Passing':[passing_math_reading_percentage]

})

district_summary['Total Budget'] = district_summary['Total Budget'].map('${:,.2f}'.format)
district_summary['Total Students'] = district_summary['Total Students'].map('{:,}'.format)
display(district_summary)

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,%Passing Math,%Passing Reading,%Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

# School Summary

In [23]:
school_data_complete.columns

Index(['student_id', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'school_id', 'type', 'size', 'budget'],
      dtype='object')

### School name / School type

In [24]:
school_types = school_data.set_index(["school_name"])["type"]
school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

### Total students per school

In [25]:
per_school_counts = school_data_complete.groupby('school_name')['student_name'].count()
per_school_counts
# per_school_counts.sum() ====> = student_count to check my answer
per_school_counts.reset_index()

              school_name  student_name
0      Bailey High School          4976
1     Cabrera High School          1858
2    Figueroa High School          2949
3        Ford High School          2739
4     Griffin High School          1468
5   Hernandez High School          4635
6      Holden High School           427
7       Huang High School          2917
8     Johnson High School          4761
9        Pena High School           962
10  Rodriguez High School          3999
11    Shelton High School          1761
12     Thomas High School          1635
13     Wilson High School          2283
14     Wright High School          1800

### Total budget per school

In [26]:
per_school_budget = school_data_complete.groupby('school_name')['budget'].mean()
#per_school_budget = school_data[['school_name','budget']] =====> another answer using the school_data data frame

per_school_budget 
#per_school_budget.sum() ====> = total budget ===> to check my answer 
per_school_budget.reset_index() # === > to make it look better

              school_name     budget
0      Bailey High School  3124928.0
1     Cabrera High School  1081356.0
2    Figueroa High School  1884411.0
3        Ford High School  1763916.0
4     Griffin High School   917500.0
5   Hernandez High School  3022020.0
6      Holden High School   248087.0
7       Huang High School  1910635.0
8     Johnson High School  3094650.0
9        Pena High School   585858.0
10  Rodriguez High School  2547363.0
11    Shelton High School  1056600.0
12     Thomas High School  1043130.0
13     Wilson High School  1319574.0
14     Wright High School  1049400.0

### Per student budget

In [27]:
budget_per_student =  per_school_budget / per_school_counts
per_student_budget =pd.DataFrame({
    'school_name': budget_per_student.index,
    'per_student_budget': budget_per_student.values
})
per_student_budget

              school_name  per_student_budget
0      Bailey High School               628.0
1     Cabrera High School               582.0
2    Figueroa High School               639.0
3        Ford High School               644.0
4     Griffin High School               625.0
5   Hernandez High School               652.0
6      Holden High School               581.0
7       Huang High School               655.0
8     Johnson High School               650.0
9        Pena High School               609.0
10  Rodriguez High School               637.0
11    Shelton High School               600.0
12     Thomas High School               638.0
13     Wilson High School               578.0
14     Wright High School               583.0

### Average math score

In [28]:
math_score_average = school_data_complete.groupby('school_name')['math_score'].mean()
average_math_score = pd.DataFrame({
    'school_name' : math_score_average.index,
    'math_score_average' : math_score_average.values
})
average_math_score

              school_name  math_score_average
0      Bailey High School           77.048432
1     Cabrera High School           83.061895
2    Figueroa High School           76.711767
3        Ford High School           77.102592
4     Griffin High School           83.351499
5   Hernandez High School           77.289752
6      Holden High School           83.803279
7       Huang High School           76.629414
8     Johnson High School           77.072464
9        Pena High School           83.839917
10  Rodriguez High School           76.842711
11    Shelton High School           83.359455
12     Thomas High School           83.418349
13     Wilson High School           83.274201
14     Wright High School           83.682222

### Average reading score

In [29]:
reading_score_average = school_data_complete.groupby('school_name')['reading_score'].mean()
average_reading_score = pd.DataFrame({
    'school_name' : reading_score_average.index,
    'average_reading_score' : reading_score_average.values
})
average_reading_score

              school_name  average_reading_score
0      Bailey High School              81.033963
1     Cabrera High School              83.975780
2    Figueroa High School              81.158020
3        Ford High School              80.746258
4     Griffin High School              83.816757
5   Hernandez High School              80.934412
6      Holden High School              83.814988
7       Huang High School              81.182722
8     Johnson High School              80.966394
9        Pena High School              84.044699
10  Rodriguez High School              80.744686
11    Shelton High School              83.725724
12     Thomas High School              83.848930
13     Wilson High School              83.989488
14     Wright High School              83.955000

### % passing math (the percentage of students who passed math)

In [30]:
passing_math = school_data_complete[school_data_complete['math_score'] >= 70 ]
passing_math

,student_id,student_name,gender,grade,school_name,reading_score,math_score,school_id,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [31]:
passing_math_school = passing_math.groupby('school_name')['student_name'].count()

passing_math_school

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
Name: student_name, dtype: int64

In [32]:
per_pass_math_by_school = (passing_math_school / per_school_counts) * 100
per_pass_math_per_school = pd.DataFrame({
    "school_name" : per_pass_math_by_school.index,
    "%passing math" : per_pass_math_by_school.values
})
per_pass_math_per_school

              school_name  %passing math
0      Bailey High School      66.680064
1     Cabrera High School      94.133477
2    Figueroa High School      65.988471
3        Ford High School      68.309602
4     Griffin High School      93.392371
5   Hernandez High School      66.752967
6      Holden High School      92.505855
7       Huang High School      65.683922
8     Johnson High School      66.057551
9        Pena High School      94.594595
10  Rodriguez High School      66.366592
11    Shelton High School      93.867121
12     Thomas High School      93.272171
13     Wilson High School      93.867718
14     Wright High School      93.333333

### % passing reading (the percentage of students who passed reading)

In [33]:
pass_reading_count = school_data_complete[ school_data_complete['math_score'] >= 70 ]
pass_reading_count

,student_id,student_name,gender,grade,school_name,reading_score,math_score,school_id,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [34]:
per_school_pass_reading_count = pass_reading_count.groupby('school_name')['math_score'].count()
per_school_pass_reading_count

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
Name: math_score, dtype: int64

In [35]:
average_reading_pass_per_school = per_school_pass_reading_count / per_school_counts * 100
reading_average_per_school = pd.DataFrame({
  'school_name' : average_reading_pass_per_school.index,
  '%passing_pass_reading' : average_reading_pass_per_school.values 
})
reading_average_per_school

              school_name  %passing_pass_reading
0      Bailey High School              66.680064
1     Cabrera High School              94.133477
2    Figueroa High School              65.988471
3        Ford High School              68.309602
4     Griffin High School              93.392371
5   Hernandez High School              66.752967
6      Holden High School              92.505855
7       Huang High School              65.683922
8     Johnson High School              66.057551
9        Pena High School              94.594595
10  Rodriguez High School              66.366592
11    Shelton High School              93.867121
12     Thomas High School              93.272171
13     Wilson High School              93.867718
14     Wright High School              93.333333

### % overall passing (the percentage of students who passed math AND reading)

In [42]:
overall_pass_count = school_data_complete[(school_data_complete['math_score'] >= 70) & (school_data_complete['reading_score'] >= 70)]
overall_pass_count

,student_id,student_name,gender,grade,school_name,reading_score,math_score,school_id,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [58]:
per_school_math_pass = passing_math_percentage.groupby('school_name')['student_name'].count()
per_school_reading_pass =  passing_reading_percentage.groupby('school_name')['reading_score'].count()

AttributeError: 'numpy.float64' object has no attribute 'groupby'

In [57]:
overall_pass_rate = per_school_over_all_pass.groupby(['school_name']).count()['student_name'] / school_count * 100
overall_pass_rate = will that work?!

KeyError: 'student_name'